app/controllers/blogs_controller.rb

  def index
    @blogs = Blog.all
---
SELECT "blogs".* FROM "blogs"

  def create
    @blog = Blog.new(blog_params)
    if @blog.save
---
INSERT INTO "blogs" ("title", "content", "created_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "sda"], ["content", "csdf"], ["created_at", "2018-11-29 19:43:04.882426"]]

  def show
    @blog = Blog.find(params[:id])
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

  def edit
    @blog = Blog.find(params[:id])
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def update
    @blog = Blog.find(params[:id])
    if @blog.update(blog_params)
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "blogs" SET "content" = $1 WHERE "blogs"."id" = $2  [["content", "csdfa"], ["id", 3]]

  def destroy
    @blog.destroy
---
DELETE FROM "blogs" WHERE "blogs"."id" = $1  [["id", 1]]

  def set_blog
    @blog = Blog.find(params[:id])
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]